{"class_name": "Model", "keras_version": "2.1.2", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 512, 512, 3], "name": "input_1", "sparse": false}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "conv2d_1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d_1"}, {"class_name": "LeakyReLU", "config": {"alpha": 9.999999747378752e-05, "trainable": true, "name": "leaky_re_lu_1"}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "leaky_re_lu_1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_2", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}]]], "name": "conv2d_2"}, {"class_name": "LeakyReLU", "config": {"alpha": 9.999999747378752e-05, "trainable": true, "name": "leaky_re_lu_2"}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "leaky_re_lu_2"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_3", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["leaky_re_lu_2", 0, 0, {}]]], "name": "conv2d_3"}, {"class_name": "LeakyReLU", "config": {"alpha": 9.999999747378752e-05, "trainable": true, "name": "leaky_re_lu_3"}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "leaky_re_lu_3"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_4", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["leaky_re_lu_3", 0, 0, {}]]], "name": "conv2d_4"}, {"class_name": "LeakyReLU", "config": {"alpha": 9.999999747378752e-05, "trainable": true, "name": "leaky_re_lu_4"}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "name": "leaky_re_lu_4"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_1", "axis": 3}, "inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}], ["leaky_re_lu_4", 0, 0, {}]]], "name": "concatenate_1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_5", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "name": "conv2d_5"}, {"class_name": "LeakyReLU", "config": {"alpha": 9.999999747378752e-05, "trainable": true, "name": "leaky_re_lu_5"}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "name": "leaky_re_lu_5"}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "inbound_nodes": [[["leaky_re_lu_5", 0, 0, {}]]], "name": "max_pooling2d_1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "conv2d_6", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "name": "conv2d_6"}, {"class_name": "LeakyReLU", "config": {"alpha": 9.999999747378752e-05, "trainable": true, "name": "leaky_re_lu_6"}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "name": "leaky_re_lu_6"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_7", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["leaky_re_lu_6", 0, 0, {}]]], "name": "conv2d_7"}, {"class_name": "LeakyReLU", "config": {"alpha": 9.999999747378752e-05, "trainable": true, "name": "leaky_re_lu_7"}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "name": "leaky_re_lu_7"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_8", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["leaky_re_lu_7", 0, 0, {}]]], "name": "conv2d_8"}, {"class_name": "LeakyReLU", "config": {"alpha": 9.999999747378752e-05, "trainable": true, "name": "leaky_re_lu_8"}, "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "name": "leaky_re_lu_8"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_9", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["leaky_re_lu_8", 0, 0, {}]]], "name": "conv2d_9"}, {"class_name": "LeakyReLU", "config": {"alpha": 9.999999747378752e-05, "trainable": true, "name": "leaky_re_lu_9"}, "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "name": "leaky_re_lu_9"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_2", "axis": 3}, "inbound_nodes": [[["leaky_re_lu_6", 0, 0, {}], ["leaky_re_lu_9", 0, 0, {}]]], "name": "concatenate_2"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_10", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "name": "conv2d_10"}, {"class_name": "LeakyReLU", "config": {"alpha": 9.999999747378752e-05, "trainable": true, "name": "leaky_re_lu_10"}, "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "name": "leaky_re_lu_10"}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "inbound_nodes": [[["leaky_re_lu_10", 0, 0, {}]]], "name": "max_pooling2d_2"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "conv2d_11", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "conv2d_11"}, {"class_name": "LeakyReLU", "config": {"alpha": 9.999999747378752e-05, "trainable": true, "name": "leaky_re_lu_11"}, "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "name": "leaky_re_lu_11"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_12", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["leaky_re_lu_11", 0, 0, {}]]], "name": "conv2d_12"}, {"class_name": "LeakyReLU", "config": {"alpha": 9.999999747378752e-05, "trainable": true, "name": "leaky_re_lu_12"}, "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "name": "leaky_re_lu_12"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_13", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["leaky_re_lu_12", 0, 0, {}]]], "name": "conv2d_13"}, {"class_name": "LeakyReLU", "config": {"alpha": 9.999999747378752e-05, "trainable": true, "name": "leaky_re_lu_13"}, "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "name": "leaky_re_lu_13"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_14", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["leaky_re_lu_13", 0, 0, {}]]], "name": "conv2d_14"}, {"class_name": "LeakyReLU", "config": {"alpha": 9.999999747378752e-05, "trainable": true, "name": "leaky_re_lu_14"}, "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "name": "leaky_re_lu_14"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_3", "axis": 3}, "inbound_nodes": [[["leaky_re_lu_11", 0, 0, {}], ["leaky_re_lu_14", 0, 0, {}]]], "name": "concatenate_3"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_15", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["concatenate_3", 0, 0, {}]]], "name": "conv2d_15"}, {"class_name": "LeakyReLU", "config": {"alpha": 9.999999747378752e-05, "trainable": true, "name": "leaky_re_lu_15"}, "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "name": "leaky_re_lu_15"}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "inbound_nodes": [[["leaky_re_lu_15", 0, 0, {}]]], "name": "max_pooling2d_3"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "conv2d_16", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "name": "conv2d_16"}, {"class_name": "LeakyReLU", "config": {"alpha": 9.999999747378752e-05, "trainable": true, "name": "leaky_re_lu_16"}, "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "name": "leaky_re_lu_16"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_17", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["leaky_re_lu_16", 0, 0, {}]]], "name": "conv2d_17"}, {"class_name": "LeakyReLU", "config": {"alpha": 9.999999747378752e-05, "trainable": true, "name": "leaky_re_lu_17"}, "inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "name": "leaky_re_lu_17"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_18", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["leaky_re_lu_17", 0, 0, {}]]], "name": "conv2d_18"}, {"class_name": "LeakyReLU", "config": {"alpha": 9.999999747378752e-05, "trainable": true, "name": "leaky_re_lu_18"}, "inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "name": "leaky_re_lu_18"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_19", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["leaky_re_lu_18", 0, 0, {}]]], "name": "conv2d_19"}, {"class_name": "LeakyReLU", "config": {"alpha": 9.999999747378752e-05, "trainable": true, "name": "leaky_re_lu_19"}, "inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "name": "leaky_re_lu_19"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_4", "axis": 3}, "inbound_nodes": [[["leaky_re_lu_16", 0, 0, {}], ["leaky_re_lu_19", 0, 0, {}]]], "name": "concatenate_4"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_20", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["concatenate_4", 0, 0, {}]]], "name": "conv2d_20"}, {"class_name": "LeakyReLU", "config": {"alpha": 9.999999747378752e-05, "trainable": true, "name": "leaky_re_lu_20"}, "inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "name": "leaky_re_lu_20"}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_4", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "inbound_nodes": [[["leaky_re_lu_20", 0, 0, {}]]], "name": "max_pooling2d_4"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "conv2d_21", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]], "name": "conv2d_21"}, {"class_name": "LeakyReLU", "config": {"alpha": 9.999999747378752e-05, "trainable": true, "name": "leaky_re_lu_21"}, "inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "name": "leaky_re_lu_21"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_22", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["leaky_re_lu_21", 0, 0, {}]]], "name": "conv2d_22"}, {"class_name": "LeakyReLU", "config": {"alpha": 9.999999747378752e-05, "trainable": true, "name": "leaky_re_lu_22"}, "inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "name": "leaky_re_lu_22"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_23", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["leaky_re_lu_22", 0, 0, {}]]], "name": "conv2d_23"}, {"class_name": "LeakyReLU", "config": {"alpha": 9.999999747378752e-05, "trainable": true, "name": "leaky_re_lu_23"}, "inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "name": "leaky_re_lu_23"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_24", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["leaky_re_lu_23", 0, 0, {}]]], "name": "conv2d_24"}, {"class_name": "LeakyReLU", "config": {"alpha": 9.999999747378752e-05, "trainable": true, "name": "leaky_re_lu_24"}, "inbound_nodes": [[["conv2d_24", 0, 0, {}]]], "name": "leaky_re_lu_24"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_5", "axis": 3}, "inbound_nodes": [[["leaky_re_lu_21", 0, 0, {}], ["leaky_re_lu_24", 0, 0, {}]]], "name": "concatenate_5"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_25", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["concatenate_5", 0, 0, {}]]], "name": "conv2d_25"}, {"class_name": "LeakyReLU", "config": {"alpha": 9.999999747378752e-05, "trainable": true, "name": "leaky_re_lu_25"}, "inbound_nodes": [[["conv2d_25", 0, 0, {}]]], "name": "leaky_re_lu_25"}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_5", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "inbound_nodes": [[["leaky_re_lu_25", 0, 0, {}]]], "name": "max_pooling2d_5"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "conv2d_26", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["max_pooling2d_5", 0, 0, {}]]], "name": "conv2d_26"}, {"class_name": "LeakyReLU", "config": {"alpha": 9.999999747378752e-05, "trainable": true, "name": "leaky_re_lu_26"}, "inbound_nodes": [[["conv2d_26", 0, 0, {}]]], "name": "leaky_re_lu_26"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_27", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["leaky_re_lu_26", 0, 0, {}]]], "name": "conv2d_27"}, {"class_name": "LeakyReLU", "config": {"alpha": 9.999999747378752e-05, "trainable": true, "name": "leaky_re_lu_27"}, "inbound_nodes": [[["conv2d_27", 0, 0, {}]]], "name": "leaky_re_lu_27"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_28", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["leaky_re_lu_27", 0, 0, {}]]], "name": "conv2d_28"}, {"class_name": "LeakyReLU", "config": {"alpha": 9.999999747378752e-05, "trainable": true, "name": "leaky_re_lu_28"}, "inbound_nodes": [[["conv2d_28", 0, 0, {}]]], "name": "leaky_re_lu_28"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_29", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["leaky_re_lu_28", 0, 0, {}]]], "name": "conv2d_29"}, {"class_name": "LeakyReLU", "config": {"alpha": 9.999999747378752e-05, "trainable": true, "name": "leaky_re_lu_29"}, "inbound_nodes": [[["conv2d_29", 0, 0, {}]]], "name": "leaky_re_lu_29"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_6", "axis": 3}, "inbound_nodes": [[["leaky_re_lu_26", 0, 0, {}], ["leaky_re_lu_29", 0, 0, {}]]], "name": "concatenate_6"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_30", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["concatenate_6", 0, 0, {}]]], "name": "conv2d_30"}, {"class_name": "LeakyReLU", "config": {"alpha": 9.999999747378752e-05, "trainable": true, "name": "leaky_re_lu_30"}, "inbound_nodes": [[["conv2d_30", 0, 0, {}]]], "name": "leaky_re_lu_30"}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_6", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "inbound_nodes": [[["leaky_re_lu_30", 0, 0, {}]]], "name": "max_pooling2d_6"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "conv2d_31", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 1024, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["max_pooling2d_6", 0, 0, {}]]], "name": "conv2d_31"}, {"class_name": "LeakyReLU", "config": {"alpha": 9.999999747378752e-05, "trainable": true, "name": "leaky_re_lu_31"}, "inbound_nodes": [[["conv2d_31", 0, 0, {}]]], "name": "leaky_re_lu_31"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_32", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 1024, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["leaky_re_lu_31", 0, 0, {}]]], "name": "conv2d_32"}, {"class_name": "LeakyReLU", "config": {"alpha": 9.999999747378752e-05, "trainable": true, "name": "leaky_re_lu_32"}, "inbound_nodes": [[["conv2d_32", 0, 0, {}]]], "name": "leaky_re_lu_32"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_33", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 1024, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["leaky_re_lu_32", 0, 0, {}]]], "name": "conv2d_33"}, {"class_name": "LeakyReLU", "config": {"alpha": 9.999999747378752e-05, "trainable": true, "name": "leaky_re_lu_33"}, "inbound_nodes": [[["conv2d_33", 0, 0, {}]]], "name": "leaky_re_lu_33"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_34", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 1024, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["leaky_re_lu_33", 0, 0, {}]]], "name": "conv2d_34"}, {"class_name": "LeakyReLU", "config": {"alpha": 9.999999747378752e-05, "trainable": true, "name": "leaky_re_lu_34"}, "inbound_nodes": [[["conv2d_34", 0, 0, {}]]], "name": "leaky_re_lu_34"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_7", "axis": 3}, "inbound_nodes": [[["leaky_re_lu_31", 0, 0, {}], ["leaky_re_lu_34", 0, 0, {}]]], "name": "concatenate_7"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_35", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 1024, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["concatenate_7", 0, 0, {}]]], "name": "conv2d_35"}, {"class_name": "LeakyReLU", "config": {"alpha": 9.999999747378752e-05, "trainable": true, "name": "leaky_re_lu_35"}, "inbound_nodes": [[["conv2d_35", 0, 0, {}]]], "name": "leaky_re_lu_35"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "data_format": "channels_last", "name": "up_sampling2d_1", "size": [2, 2]}, "inbound_nodes": [[["leaky_re_lu_35", 0, 0, {}]]], "name": "up_sampling2d_1"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_8", "axis": 3}, "inbound_nodes": [[["leaky_re_lu_30", 0, 0, {}], ["up_sampling2d_1", 0, 0, {}]]], "name": "concatenate_8"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "conv2d_36", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["concatenate_8", 0, 0, {}]]], "name": "conv2d_36"}, {"class_name": "LeakyReLU", "config": {"alpha": 9.999999747378752e-05, "trainable": true, "name": "leaky_re_lu_36"}, "inbound_nodes": [[["conv2d_36", 0, 0, {}]]], "name": "leaky_re_lu_36"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_37", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["leaky_re_lu_36", 0, 0, {}]]], "name": "conv2d_37"}, {"class_name": "LeakyReLU", "config": {"alpha": 9.999999747378752e-05, "trainable": true, "name": "leaky_re_lu_37"}, "inbound_nodes": [[["conv2d_37", 0, 0, {}]]], "name": "leaky_re_lu_37"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_38", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["leaky_re_lu_37", 0, 0, {}]]], "name": "conv2d_38"}, {"class_name": "LeakyReLU", "config": {"alpha": 9.999999747378752e-05, "trainable": true, "name": "leaky_re_lu_38"}, "inbound_nodes": [[["conv2d_38", 0, 0, {}]]], "name": "leaky_re_lu_38"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_39", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["leaky_re_lu_38", 0, 0, {}]]], "name": "conv2d_39"}, {"class_name": "LeakyReLU", "config": {"alpha": 9.999999747378752e-05, "trainable": true, "name": "leaky_re_lu_39"}, "inbound_nodes": [[["conv2d_39", 0, 0, {}]]], "name": "leaky_re_lu_39"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_9", "axis": 3}, "inbound_nodes": [[["leaky_re_lu_36", 0, 0, {}], ["leaky_re_lu_39", 0, 0, {}]]], "name": "concatenate_9"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_40", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["concatenate_9", 0, 0, {}]]], "name": "conv2d_40"}, {"class_name": "LeakyReLU", "config": {"alpha": 9.999999747378752e-05, "trainable": true, "name": "leaky_re_lu_40"}, "inbound_nodes": [[["conv2d_40", 0, 0, {}]]], "name": "leaky_re_lu_40"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "data_format": "channels_last", "name": "up_sampling2d_2", "size": [2, 2]}, "inbound_nodes": [[["leaky_re_lu_40", 0, 0, {}]]], "name": "up_sampling2d_2"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_10", "axis": 3}, "inbound_nodes": [[["leaky_re_lu_25", 0, 0, {}], ["up_sampling2d_2", 0, 0, {}]]], "name": "concatenate_10"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "conv2d_41", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["concatenate_10", 0, 0, {}]]], "name": "conv2d_41"}, {"class_name": "LeakyReLU", "config": {"alpha": 9.999999747378752e-05, "trainable": true, "name": "leaky_re_lu_41"}, "inbound_nodes": [[["conv2d_41", 0, 0, {}]]], "name": "leaky_re_lu_41"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_42", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["leaky_re_lu_41", 0, 0, {}]]], "name": "conv2d_42"}, {"class_name": "LeakyReLU", "config": {"alpha": 9.999999747378752e-05, "trainable": true, "name": "leaky_re_lu_42"}, "inbound_nodes": [[["conv2d_42", 0, 0, {}]]], "name": "leaky_re_lu_42"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_43", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["leaky_re_lu_42", 0, 0, {}]]], "name": "conv2d_43"}, {"class_name": "LeakyReLU", "config": {"alpha": 9.999999747378752e-05, "trainable": true, "name": "leaky_re_lu_43"}, "inbound_nodes": [[["conv2d_43", 0, 0, {}]]], "name": "leaky_re_lu_43"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_44", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["leaky_re_lu_43", 0, 0, {}]]], "name": "conv2d_44"}, {"class_name": "LeakyReLU", "config": {"alpha": 9.999999747378752e-05, "trainable": true, "name": "leaky_re_lu_44"}, "inbound_nodes": [[["conv2d_44", 0, 0, {}]]], "name": "leaky_re_lu_44"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_11", "axis": 3}, "inbound_nodes": [[["leaky_re_lu_41", 0, 0, {}], ["leaky_re_lu_44", 0, 0, {}]]], "name": "concatenate_11"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_45", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["concatenate_11", 0, 0, {}]]], "name": "conv2d_45"}, {"class_name": "LeakyReLU", "config": {"alpha": 9.999999747378752e-05, "trainable": true, "name": "leaky_re_lu_45"}, "inbound_nodes": [[["conv2d_45", 0, 0, {}]]], "name": "leaky_re_lu_45"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "data_format": "channels_last", "name": "up_sampling2d_3", "size": [2, 2]}, "inbound_nodes": [[["leaky_re_lu_45", 0, 0, {}]]], "name": "up_sampling2d_3"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_12", "axis": 3}, "inbound_nodes": [[["leaky_re_lu_20", 0, 0, {}], ["up_sampling2d_3", 0, 0, {}]]], "name": "concatenate_12"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "conv2d_46", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["concatenate_12", 0, 0, {}]]], "name": "conv2d_46"}, {"class_name": "LeakyReLU", "config": {"alpha": 9.999999747378752e-05, "trainable": true, "name": "leaky_re_lu_46"}, "inbound_nodes": [[["conv2d_46", 0, 0, {}]]], "name": "leaky_re_lu_46"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_47", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["leaky_re_lu_46", 0, 0, {}]]], "name": "conv2d_47"}, {"class_name": "LeakyReLU", "config": {"alpha": 9.999999747378752e-05, "trainable": true, "name": "leaky_re_lu_47"}, "inbound_nodes": [[["conv2d_47", 0, 0, {}]]], "name": "leaky_re_lu_47"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_48", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["leaky_re_lu_47", 0, 0, {}]]], "name": "conv2d_48"}, {"class_name": "LeakyReLU", "config": {"alpha": 9.999999747378752e-05, "trainable": true, "name": "leaky_re_lu_48"}, "inbound_nodes": [[["conv2d_48", 0, 0, {}]]], "name": "leaky_re_lu_48"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_49", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["leaky_re_lu_48", 0, 0, {}]]], "name": "conv2d_49"}, {"class_name": "LeakyReLU", "config": {"alpha": 9.999999747378752e-05, "trainable": true, "name": "leaky_re_lu_49"}, "inbound_nodes": [[["conv2d_49", 0, 0, {}]]], "name": "leaky_re_lu_49"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_13", "axis": 3}, "inbound_nodes": [[["leaky_re_lu_46", 0, 0, {}], ["leaky_re_lu_49", 0, 0, {}]]], "name": "concatenate_13"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_50", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["concatenate_13", 0, 0, {}]]], "name": "conv2d_50"}, {"class_name": "LeakyReLU", "config": {"alpha": 9.999999747378752e-05, "trainable": true, "name": "leaky_re_lu_50"}, "inbound_nodes": [[["conv2d_50", 0, 0, {}]]], "name": "leaky_re_lu_50"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "data_format": "channels_last", "name": "up_sampling2d_4", "size": [2, 2]}, "inbound_nodes": [[["leaky_re_lu_50", 0, 0, {}]]], "name": "up_sampling2d_4"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_14", "axis": 3}, "inbound_nodes": [[["leaky_re_lu_15", 0, 0, {}], ["up_sampling2d_4", 0, 0, {}]]], "name": "concatenate_14"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "conv2d_51", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["concatenate_14", 0, 0, {}]]], "name": "conv2d_51"}, {"class_name": "LeakyReLU", "config": {"alpha": 9.999999747378752e-05, "trainable": true, "name": "leaky_re_lu_51"}, "inbound_nodes": [[["conv2d_51", 0, 0, {}]]], "name": "leaky_re_lu_51"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_52", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["leaky_re_lu_51", 0, 0, {}]]], "name": "conv2d_52"}, {"class_name": "LeakyReLU", "config": {"alpha": 9.999999747378752e-05, "trainable": true, "name": "leaky_re_lu_52"}, "inbound_nodes": [[["conv2d_52", 0, 0, {}]]], "name": "leaky_re_lu_52"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": 