{"class_name": "Model", "keras_version": "2.1.2", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 512, 512, 3], "name": "input_1", "sparse": false}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "ZeroPadding2D", "config": {"padding": [[3, 3], [3, 3]], "trainable": true, "name": "zero_padding2d_1", "data_format": "channels_last"}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "zero_padding2d_1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "conv2d_1", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [7, 7]}, "inbound_nodes": [[["zero_padding2d_1", 0, 0, {}]]], "name": "conv2d_1"}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_2", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "zero_padding2d_2"}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "data_format": "channels_last", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2]}, "inbound_nodes": [[["zero_padding2d_2", 0, 0, {}]]], "name": "max_pooling2d_1"}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_3", "data_format": "channels_last"}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "name": "zero_padding2d_3"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "conv2d_2", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]], "name": "conv2d_2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "activation_1"}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_4", "data_format": "channels_last"}, "inbound_nodes": [[["activation_1", 0, 0, {}]]], "name": "zero_padding2d_4"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "conv2d_3", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["zero_padding2d_4", 0, 0, {}]]], "name": "conv2d_3"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_1"}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}], ["conv2d_3", 0, 0, {}]]], "name": "add_1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "inbound_nodes": [[["add_1", 0, 0, {}]]], "name": "activation_2"}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_5", "data_format": "channels_last"}, "inbound_nodes": [[["activation_2", 0, 0, {}]]], "name": "zero_padding2d_5"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "conv2d_4", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["zero_padding2d_5", 0, 0, {}]]], "name": "conv2d_4"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "name": "activation_3"}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_6", "data_format": "channels_last"}, "inbound_nodes": [[["activation_3", 0, 0, {}]]], "name": "zero_padding2d_6"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "conv2d_5", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["zero_padding2d_6", 0, 0, {}]]], "name": "conv2d_5"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_2"}, "inbound_nodes": [[["activation_2", 0, 0, {}], ["conv2d_5", 0, 0, {}]]], "name": "add_2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}, "inbound_nodes": [[["add_2", 0, 0, {}]]], "name": "activation_4"}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_7", "data_format": "channels_last"}, "inbound_nodes": [[["activation_4", 0, 0, {}]]], "name": "zero_padding2d_7"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "conv2d_6", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["zero_padding2d_7", 0, 0, {}]]], "name": "conv2d_6"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_5"}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "name": "activation_5"}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_8", "data_format": "channels_last"}, "inbound_nodes": [[["activation_5", 0, 0, {}]]], "name": "zero_padding2d_8"}, {"class_name": "ZeroPadding2D", "config": {"padding": [[0, 0], [0, 0]], "trainable": true, "name": "zero_padding2d_9", "data_format": "channels_last"}, "inbound_nodes": [[["activation_4", 0, 0, {}]]], "name": "zero_padding2d_9"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "conv2d_7", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["zero_padding2d_8", 0, 0, {}]]], "name": "conv2d_7"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "conv2d_8", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["zero_padding2d_9", 0, 0, {}]]], "name": "conv2d_8"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_3"}, "inbound_nodes": [[["conv2d_7", 0, 0, {}], ["conv2d_8", 0, 0, {}]]], "name": "add_3"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_6"}, "inbound_nodes": [[["add_3", 0, 0, {}]]], "name": "activation_6"}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_10", "data_format": "channels_last"}, "inbound_nodes": [[["activation_6", 0, 0, {}]]], "name": "zero_padding2d_10"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "conv2d_9", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["zero_padding2d_10", 0, 0, {}]]], "name": "conv2d_9"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_7"}, "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "name": "activation_7"}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_11", "data_format": "channels_last"}, "inbound_nodes": [[["activation_7", 0, 0, {}]]], "name": "zero_padding2d_11"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "conv2d_10", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["zero_padding2d_11", 0, 0, {}]]], "name": "conv2d_10"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_4"}, "inbound_nodes": [[["activation_6", 0, 0, {}], ["conv2d_10", 0, 0, {}]]], "name": "add_4"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_8"}, "inbound_nodes": [[["add_4", 0, 0, {}]]], "name": "activation_8"}, {"class_name": "ZeroPadding2D", "config": {"padding": [[2, 2], [2, 2]], "trainable": true, "name": "zero_padding2d_12", "data_format": "channels_last"}, "inbound_nodes": [[["activation_8", 0, 0, {}]]], "name": "zero_padding2d_12"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "conv2d_11", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [2, 2], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["zero_padding2d_12", 0, 0, {}]]], "name": "conv2d_11"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_9"}, "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "name": "activation_9"}, {"class_name": "ZeroPadding2D", "config": {"padding": [[2, 2], [2, 2]], "trainable": true, "name": "zero_padding2d_13", "data_format": "channels_last"}, "inbound_nodes": [[["activation_9", 0, 0, {}]]], "name": "zero_padding2d_13"}, {"class_name": "ZeroPadding2D", "config": {"padding": [[0, 0], [0, 0]], "trainable": true, "name": "zero_padding2d_14", "data_format": "channels_last"}, "inbound_nodes": [[["activation_8", 0, 0, {}]]], "name": "zero_padding2d_14"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "conv2d_12", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [2, 2], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["zero_padding2d_13", 0, 0, {}]]], "name": "conv2d_12"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "conv2d_13", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["zero_padding2d_14", 0, 0, {}]]], "name": "conv2d_13"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_5"}, "inbound_nodes": [[["conv2d_12", 0, 0, {}], ["conv2d_13", 0, 0, {}]]], "name": "add_5"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_10"}, "inbound_nodes": [[["add_5", 0, 0, {}]]], "name": "activation_10"}, {"class_name": "ZeroPadding2D", "config": {"padding": [[2, 2], [2, 2]], "trainable": true, "name": "zero_padding2d_15", "data_format": "channels_last"}, "inbound_nodes": [[["activation_10", 0, 0, {}]]], "name": "zero_padding2d_15"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "conv2d_14", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [2, 2], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["zero_padding2d_15", 0, 0, {}]]], "name": "conv2d_14"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_11"}, "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "name": "activation_11"}, {"class_name": "ZeroPadding2D", "config": {"padding": [[2, 2], [2, 2]], "trainable": true, "name": "zero_padding2d_16", "data_format": "channels_last"}, "inbound_nodes": [[["activation_11", 0, 0, {}]]], "name": "zero_padding2d_16"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "conv2d_15", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [2, 2], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["zero_padding2d_16", 0, 0, {}]]], "name": "conv2d_15"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_6"}, "inbound_nodes": [[["activation_10", 0, 0, {}], ["conv2d_15", 0, 0, {}]]], "name": "add_6"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_12"}, "inbound_nodes": [[["add_6", 0, 0, {}]]], "name": "activation_12"}, {"class_name": "ZeroPadding2D", "config": {"padding": [[4, 4], [4, 4]], "trainable": true, "name": "zero_padding2d_17", "data_format": "channels_last"}, "inbound_nodes": [[["activation_12", 0, 0, {}]]], "name": "zero_padding2d_17"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "conv2d_16", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [4, 4], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["zero_padding2d_17", 0, 0, {}]]], "name": "conv2d_16"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_13"}, "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "name": "activation_13"}, {"class_name": "ZeroPadding2D", "config": {"padding": [[4, 4], [4, 4]], "trainable": true, "name": "zero_padding2d_18", "data_format": "channels_last"}, "inbound_nodes": [[["activation_13", 0, 0, {}]]], "name": "zero_padding2d_18"}, {"class_name": "ZeroPadding2D", "config": {"padding": [[0, 0], [0, 0]], "trainable": true, "name": "zero_padding2d_19", "data_format": "channels_last"}, "inbound_nodes": [[["activation_12", 0, 0, {}]]], "name": "zero_padding2d_19"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "conv2d_17", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [4, 4], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["zero_padding2d_18", 0, 0, {}]]], "name": "conv2d_17"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "conv2d_18", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["zero_padding2d_19", 0, 0, {}]]], "name": "conv2d_18"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_7"}, "inbound_nodes": [[["conv2d_17", 0, 0, {}], ["conv2d_18", 0, 0, {}]]], "name": "add_7"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_14"}, "inbound_nodes": [[["add_7", 0, 0, {}]]], "name": "activation_14"}, {"class_name": "ZeroPadding2D", "config": {"padding": [[4, 4], [4, 4]], "trainable": true, "name": "zero_padding2d_20", "data_format": "channels_last"}, "inbound_nodes": [[["activation_14", 0, 0, {}]]], "name": "zero_padding2d_20"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "conv2d_19", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [4, 4], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["zero_padding2d_20", 0, 0, {}]]], "name": "conv2d_19"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_15"}, "inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "name": "activation_15"}, {"class_name": "ZeroPadding2D", "config": {"padding": [[4, 4], [4, 4]], "trainable": true, "name": "zero_padding2d_21", "data_format": "channels_last"}, "inbound_nodes": [[["activation_15", 0, 0, {}]]], "name": "zero_padding2d_21"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "conv2d_20", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [4, 4], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["zero_padding2d_21", 0, 0, {}]]], "name": "conv2d_20"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_8"}, "inbound_nodes": [[["activation_14", 0, 0, {}], ["conv2d_20", 0, 0, {}]]], "name": "add_8"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_16"}, "inbound_nodes": [[["add_8", 0, 0, {}]]], "name": "activation_16"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "conv2d_21", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["activation_16", 0, 0, {}]]], "name": "conv2d_21"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_22", "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "name": "conv2d_22"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "data_format": "channels_last", "name": "up_sampling2d_1", "size": [8, 8]}, "inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "name": "up_sampling2d_1"}], "input_layers": [["input_1", 0, 0]], "output_layers": [["up_sampling2d_1", 0, 0]], "name": "model_1"}, "backend": "tensorflow"}